// MONITORADO DEFAULT SETTINGS
{
    "monitorado": {
        // List of aggregated keys that should be generated on the output. For example
        // to show an aggregated "upserts" for metrics of "users.insert" and "users.update":
        // "aggregatedKeys": {"upserts": ["users.insert", "users.update"]}
        "aggregatedKeys": null,
        // Cleanup empty metrics (total calls = 0)?
        "cleanupEmpty": true,
        // Cleanup interval (in minutes).
        "cleanupInterval": 10,
        // Clear metrics older than 12 hours (value in minutes). Please note that this
        // value should be at least equal to the highest value of the `intervals` array.
        "expireAfter": 720,
        // Set the values below if you wish the module to spin up a HTTP server to serve the metrics output.
        // You can also set the path (default is /, but for example you could use /metrics).
        "httpServer": {
            // Port used by the HTTP server.
            "port": null,
            // By default the metrics server will listen on root.
            "path": "/",
            // String or array of strings containing valid bearer tokens to access the metrics.
            // Please note that this is a very simple implementation, consider managing the
            // authentication on a layer before the actual HTTP server (load balancer for example).
            "token": null
        },
        // Include last X samples on generated output? Set to 0 to not include any.
        "includeLastSamples": 0,
        // Intervals to show on the output, in minutes.
        "intervals": [1, 5, 20],
        // Percentiles to include on output. Leave empty to not calculate percentiles.
        "percentiles": [99, 95, 90],
        // Default save path when calling metrics.save() without specifying the destination.
        // Please note that it will be a relative path to the root if not starting with /.
        "savePath": "monitorado.json",
        // Include server CPU / RAM metrics on output? Leave "fields" empty if you
        // don't want to include server metrics on the metrics output.
        "systemMetrics": {
            "key": "system",
            "fields": ["loadAvg", "memoryUsage", "process"],
            // Set to false if you wish to hide labels from output and have only the numeric values.
            // Note: memory related metrics are always displayed in Megabytes (MB).
            "includeLabels": true
        }
    }
}
